codeigniter4/app/Controllers/QuizController.php

SELECT *
FROM "questions"
WHERE "quiz_id" = '1'
SELECT *
FROM "options"
WHERE "question_id" = '1'
---
    public function getQuizDetails($quizId)
    {
        // Check if the Authorization header has the correct token
        $authHeader = $this->request->getHeaderLine('Authorization');
        $adminToken = 'Bearer TIRHRRADah7zNjQaNLFTFC5AUelExF_C-D8BO2egzYGwmuX2nPaED-U1h1sgkiJFWaDsIUGblvxIAjqhD1ZO-Q';  // Admin Token
        $userToken = 'Bearer urhiC4D9TQoao9P583pTmFNmSA5Vdv-Nh6XuY3d98DJd0i1e4r-vbx25F9QdY_U-Oyu7TYkeiMZoqpjQ3ws4xA'; // Replace this with the actual User Token

        if ($authHeader !== $adminToken && $authHeader !== $userToken) {
            return $this->response->setStatusCode(401)->setJSON(['error' => 'Invalid token']);
        }

        // If the token is valid, retrieve quiz data
        $quizModel = new QuizModel();
        $quiz = $quizModel->find($quizId);

        if ($quiz) {
            // Fetch the questions for the quiz
            $questionModel = new QuestionModel();
            $questions = $questionModel->where('quiz_id', $quizId)->findAll();

            // Initialize an array to hold the quiz details with questions and options
            $quizData = [];

            foreach ($questions as $question) {
                // Fetch the options for each question
                $optionModel = new OptionModel();
                $options = $optionModel->where('question_id', $question['id'])->findAll();