codeigniter4/app/Controllers/QuizController.php

    public function getQuizDetails($quizId)
    {
        $decoded = $this->validateToken();
        if (!$decoded) return;

        // If the token is valid, retrieve quiz data
        $db = \Config\Database::connect();

        // Get quiz basic info
        $quizQuery = $db->table('quizzes')
            ->select('title, description')
            ->where('id', $quizId);

        $quiz = $quizQuery->get()->getRowArray();

        if ($quiz) {
            // Get questions
            $questionsQuery = $db->table('questions')
                ->select('id, question_text')
                ->where('quiz_id', $quizId);

            $questions = $questionsQuery->get()->getResultArray();
---
SELECT "title", "description"
FROM "quizzes"
WHERE "id" = '2'
SELECT "id", "question_text"
FROM "questions"
WHERE "quiz_id" = '2'

    public function startQuiz($quizId)
    {
        $quizModel = new QuizModel();
        $questionModel = new QuestionModel();
        $optionModel = new OptionModel();

        // Fetch the quiz data
        $quiz = $quizModel->find($quizId);
        if (!$quiz) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Quiz not found');
        }

        // Fetch the related questions and options for the quiz
        $questions = $questionModel->where('quiz_id', $quizId)->findAll();
        foreach ($questions as &$question) {
            $question['options'] = $optionModel->where('question_id', $question['id'])->findAll();
---
SELECT *
FROM "questions"
WHERE "quiz_id" = '1'
SELECT *
FROM "options"
WHERE "question_id" = '1'

    public function submitQuiz()
    {
        $quizId = $this->request->getPost('quiz_id');
        $userId = session()->get('user_id'); // Get the logged-in user ID
        $answers = $this->request->getPost('answers'); // Answers from the form

        if (empty($answers) || empty($quizId)) {
            return redirect()->to('/dashboard')->with('error', 'No answers provided or invalid quiz');
        }

        // Fetch quiz and questions
        $quizModel = new QuizModel();
        $questionModel = new QuestionModel();
        $optionModel = new OptionModel();

        // Calculate score
        $score = 0;
        $correctAnswers = [];

        foreach ($answers as $questionId => $selectedOptionId) {
            $question = $questionModel->find($questionId);
            $correctOption = $optionModel->where('question_id', $questionId)
                                         ->where('is_correct', true)
                                         ->first();
---
SELECT *
FROM "questions"
WHERE "questions"."id" = 1
SELECT *
FROM "options"
WHERE "question_id" = 1
AND "is_correct" = TRUE
 LIMIT 1