codeigniter4/app/Controllers/UserController.php

    public function save()
    {
        $data = $this->request->getJSON(true);  // Get JSON request data

        if (!$data) {
            // If no JSON data was sent, fall back to form data
            $data = [
                'username' => $this->request->getPost('username'),
                'email' => $this->request->getPost('email'),
                'password' => $this->request->getPost('password'),
            ];
        }

        // Validate the input data
        if (!isset($data['username'], $data['email'], $data['password'])) {
            return $this->response->setStatusCode(400)->setJSON(['error' => 'Missing required fields']);
        }

        $userModel = new UserModel();

        // Prepare data for saving
        $dataToSave = [
            'username' => $data['username'],
            'email' => $data['email'],
            'password' => password_hash($data['password'], PASSWORD_BCRYPT),
            'role' => 'User',  // Default role is 'User'
        ];

        // Save the user data to the database
        if ($userModel->save($dataToSave)) {
---
INSERT INTO "users" ("username", "email", "password", "role") VALUES ('tesmambo', 'tesmambo@gmail.com', '$2y$10$CvdsdV/NA0KgeODlvmkm7e7xhd3NmEXVmuyBlXVM9f8EfhLbtk32O', 'User')

    public function loginAttempt()
    {
        $data = $this->request->getJSON(true);  // Get JSON request data

        if (!$data) {
            // If no JSON data was sent, fall back to form data
            $data = [
                'email' => $this->request->getPost('email'),
                'password' => $this->request->getPost('password'),
            ];
        }

        // Validate the input data
        if (!isset($data['email'], $data['password'])) {
            return $this->response->setStatusCode(400)->setJSON(['error' => 'Email or password missing']);
        }

        $userModel = new UserModel();
        $email = $data['email'];
        $password = $data['password'];

        // Check if the user exists
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM "users"
WHERE "email" = 'mambo4@mambo.mambo'
 LIMIT 1