codeigniter4/app/Views/quiz/quiz_result.php

SELECT *
FROM "questions"
WHERE "questions"."id" = 1
---
            <h3>Answers:</h3>
            <?php foreach ($correctAnswers as $questionId => $answer): ?>
                <div class="question">
                    <?php $question = (new \App\Models\QuestionModel())->find($questionId); ?>

SELECT *
FROM "options"
WHERE "options"."id" = '1'
---
                    <div class="answer <?= ($answer['selected_option_id'] == $answer['correct_option_id']) ? 'correct' : 'incorrect' ?>">
                        <strong>Your Answer:</strong>
                        <?php
                            $selectedOption = (new \App\Models\OptionModel())->find($answer['selected_option_id']);

SELECT *
FROM "options"
WHERE "options"."id" = '1'
---
                    <div class="answer correct">
                        <strong>Correct Answer:</strong>
                        <?php
                            $correctOption = (new \App\Models\OptionModel())->find($answer['correct_option_id']);